In [1]:
import pandas as pd
import numpy as np
import random as rnd

In [4]:
students_df = pd.read_csv('data/StudentsPerformance.csv')

In [5]:
students_df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [6]:
students_df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [7]:
students_df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [11]:
students_df.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [19]:
larger_testscores = students_df[students_df["math score"] > 65]

In [21]:
larger_testscores.describe()

       math score  reading score  writing score
count  517.000000     517.000000     517.000000
mean    77.709865      78.352031      77.295938
std      8.610486      10.442342      10.944338
min     66.000000      49.000000      50.000000
25%     71.000000      72.000000      69.000000
50%     76.000000      78.000000      77.000000
75%     83.000000      86.000000      85.000000
max    100.000000     100.000000     100.000000

In [22]:
smaller_testscores = students_df[students_df['math score'] < 65]

In [23]:
smaller_testscores.describe()

       math score  reading score  writing score
count  447.000000     447.000000     447.000000
mean    52.736018      58.228188      57.051454
std      9.689212      11.282027      12.314072
min      0.000000      17.000000      10.000000
25%     48.000000      52.000000      49.000000
50%     55.000000      59.000000      57.000000
75%     60.000000      66.000000      66.000000
max     64.000000      86.000000      87.000000

In [24]:
students_df.mode()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some college,standard,none,65,72,74